package BeiKe_20180903;
/*Bridge
  时间限制:C/C++语言 1000MS; 其他语言 3000MS
  内存限制:C/C++语言 65536KB；其他语言 589824KB
  题目描述：
  在小红所住的村子，有n间房屋，房屋之间由m条道路相互连接。
  对于一条路而言，如果去掉这条路，就使得整个村庄不连通，那么这条路就叫做天路。
  整个村庄不连通的定义为：存在两个不同的房屋A,B,A不可以通过道路走到房屋B。
  现在小红可以在村庄多修一条路，连接两个房屋，她想让天路变得越少越好，请问最少
  能变成多少呢？

  输入描述
  本题包含若干组测试数据。
  对于每组测试数据。
  第一行两个整数n,m表示 房屋的个数和道路的条数。
  接下来m行，每行两个整数a,b,表示有一条双向的道路连接a,b两个房屋。
  满足2<=n,m<=100000,a!=b,1<=a,b<=n
  输出描述
  对于每组测试数据，输出最少的天路数量。

  样例
  输入
  4 4
  1 2
  1 3
  1 4
  2 3
  输出
  0
 */
public class Two {
}
